In [4]:
import pandas as pd

las = pd.read_csv("grocery/sales.csv",delimiter=";")

In [9]:
las["SalesDate"] = pd.to_datetime(las["SalesDate"] )

In [11]:
las["SalesDate"].max()

Timestamp('2018-05-09 23:59:59.400000')

In [16]:
las["ProductID"].value_counts().min()

14678

In [15]:
las["ProductID"].value_counts().max()

15357

In [17]:
las["Quantity"].value_counts()

18    271335
11    271326
24    270949
16    270925
22    270805
20    270702
6     270618
14    270533
15    270528
5     270499
4     270495
13    270426
17    270377
3     270196
9     270136
8     270084
25    270060
23    270056
19    269942
12    269853
21    269749
1     269694
7     269667
2     269618
10    269552
Name: Quantity, dtype: int64

In [19]:
las["TotalPrice"].value_counts()

0,00    6758125
Name: TotalPrice, dtype: int64

In [5]:
las.head()

,SalesID,SalesPersonID,CustomerID,ProductID,Quantity,Discount,TotalPrice,SalesDate,TransactionNumber
0,1,6,27039,381,7,NaN,"0,00",2018-02-05 07:38:25.430,FQL4S94E4ME1EZFTG42G
1,2,16,25011,61,7,NaN,"0,00",2018-02-02 16:03:31.150,12UGLX40DJ1A5DTFBHB8
2,3,13,94024,23,24,NaN,"0,00",2018-05-03 19:31:56.880,5DT8RCPL87KI5EORO7B0
3,4,8,73966,176,19,0.2,"0,00",2018-04-07 14:43:55.420,R3DR9MLD5NR76VO17ULE
4,5,10,32653,310,9,NaN,"0,00",2018-02-12 15:37:03.940,4BGS0Z5OMAZ8NDAFHHP3